src/sit-boost-your-tech-career.org
#+title: SIT / Boost your tech career

https://www.youtube.com/playlist?list=PLA8lYuzFlBqCnvkSNeM7AYIy9AkTVjEJs

#+BEGIN_EXPORT HTML
<iframe width="560" height="315" src="https://www.youtube.com/embed/Snp8B0tcDs0" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen></iframe>
#+END_EXPORT

HOW TO THRIVE IN AN AMERICAN TECH COMPANY - SUCCESS IN TECH
- Independence. Do your own research.
- Cross functional teams. Reach out.
- Cultural fit. Be social, and don't hide.

3 QUICK TIPS FOR YOUR TECH CAREER AT GOOGLE, FACEBOOK AND OTHERS
- Clarifying questions. when in doubt, ask!
- Be transparent. Communicate project status.
- Reach out. Know how other teams work.

WHEN TO ASK FOR HELP -VS- DOING IT ON YOUR OWN
- Look up first! only for a couple of minutes.
- Ask resource. then do your research.
- Balance. Time vs. productivity.
