html/sit-boost-your-tech-career.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SIT / Boost your tech career</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">SIT / Boost your tech career</h1>
<p>
<a href="https://www.youtube.com/playlist?list=PLA8lYuzFlBqCnvkSNeM7AYIy9AkTVjEJs">https://www.youtube.com/playlist?list=PLA8lYuzFlBqCnvkSNeM7AYIy9AkTVjEJs</a>
</p>

<div class="export">
<p>
&lt;iframe width="560" height="315" src="<a href="https://www.youtube.com/embed/Snp8B0tcDs0">https://www.youtube.com/embed/Snp8B0tcDs0</a>" frameborder="0" allow="autoplay; encrypted-media" allowfullscreen&gt;&lt;/iframe&gt;
</p>

</div>

<p>
HOW TO THRIVE IN AN AMERICAN TECH COMPANY - SUCCESS IN TECH
</p>
<ul class="org-ul">
<li>Independence. Do your own research.
</li>
<li>Cross functional teams. Reach out.
</li>
<li>Cultural fit. Be social, and don't hide.
</li>
</ul>

<p>
3 QUICK TIPS FOR YOUR TECH CAREER AT GOOGLE, FACEBOOK AND OTHERS
</p>
<ul class="org-ul">
<li>Clarifying questions. when in doubt, ask!
</li>
<li>Be transparent. Communicate project status.
</li>
<li>Reach out. Know how other teams work.
</li>
</ul>

<p>
WHEN TO ASK FOR HELP -VS- DOING IT ON YOUR OWN
</p>
<ul class="org-ul">
<li>Look up first! only for a couple of minutes.
</li>
<li>Ask resource. then do your research.
</li>
<li>Balance. Time vs. productivity.
</li>
</ul>
</div>
</body>
</html>
